#pragma once

#define		CIRCUIT_PARENT	16
#define		CIRCUIT_CNT		41

enum {
	설비명_소화전 = 0,		// 0
	설비명_발신기,			// 1
	설비명_계단감지기,		// 2
	설비명_ELEV감지기,		// 3
	설비명_감지기,			// 4
	설비명_AN연기,			// 5
	설비명_AN정온,			// 6
	설비명_주소형연기,		// 7
	설비명_주소형정온,		// 8
	설비명_주소형차동,		// 9
	설비명_SVP감지기A,		// 10
	설비명_SVP감지기B,		// 11
	설비명_SVPP_S,			// 12
	설비명_SVPT_S,			// 13
	설비명_AVP_S,			// 14
	설비명_AVT_S,			// 15
	설비명_셔터연감지기,	// 16
	설비명_셔텨열감지기,	// 17
	설비명_셔터1차폐쇄,	// 18
	설비명_셔터2차폐쇄,	// 19
	설비명_전실급기댐퍼,	// 20
	설비명_전실급기수동,	// 21
	설비명_전실배기댐퍼,	// 22
	설비명_전실배기수동,	// 23
	설비명_자동폐쇄,		// 24
	설비명_창문폐쇄,		// 25
	설비명_배연창,			// 26
	설비명_방화문,			// 27
	설비명_P_L점등,		// 28
	설비명_유도등점등,		// 29
	//설비명_가스감지기A,	// 30
	//설비명_가스감지기B,	// 31
	//설비명_가스방출확인,	// 32
	//설비명_가스수동기동,	// 33
	설비명_저수위F_S,		// 34
	설비명_PUMPP_S,		// 35
	설비명_PUMPT_S,		// 36
	설비명_제연수동기동,	// 37
	설비명_SMD확인,		// 38
	설비명_MVD확인,		// 39
	설비명_급기팬,		// 40
	설비명_배기팬,		// 41
	설비명_저수위T_S,		// 42
	설비명_옥상문,			// 43
	설비명_시각경보,		// 44
};

static const TCHAR* g_lpszCircuitName[] = {
	_T("소화전"),		// 0
	_T("발신기"),		// 1
	_T("계단감지기"),	// 2
	_T("ELEV감지기"),	// 3
	_T("감지기"),		// 4
	_T("AN연기"),		// 5
	_T("AN정온"),		// 6
	_T("주소형연기"),	// 7
	_T("주소형정온"),	// 8
	_T("주소형차동"),	// 9
	_T("SVP감지기A"),	// 10
	_T("SVP감지기B"),	// 11
	_T("SVP P/S"),		// 12
	_T("SVP T/S"),		// 13
	_T("AV P/S"),		// 14
	_T("AV T/S"),		// 15
	_T("셔터연감지기"), // 16
	_T("셔텨열감지기"), // 17
	_T("셔터1차폐쇄"),	// 18
	_T("셔터2차폐쇄"),	// 19
	_T("전실급기댐퍼"), // 20
	_T("전실급기수동"), // 21
	_T("전실배기댐퍼"), // 22
	_T("전실배기수동"), // 23
	_T("자동폐쇄"),		// 24
	_T("창문폐쇄"),		// 25
	_T("배연창"),		// 26
	_T("방화문"),		// 27
	_T("P/L점등"),		// 28
	_T("유도등점등"),	// 29
	//_T("가스감지기A"),	// 30
	//_T("가스감지기B"),	// 31
	//_T("가스방출확인"), // 32
	//_T("가스수동기동"), // 33
	_T("저수위F/S"),	// 34
	_T("PUMP P/S"),		// 35
	_T("PUMP T/S"),		// 36
	_T("제연수동기동"), // 37
	_T("SMD확인"),		// 38
	_T("MVD확인"),		// 39
	_T("급기팬"),		// 40
	_T("배기팬"),		// 41
	_T("저수위T/S"),	// 42
	_T("옥상문"),		// 43
	_T("시각경보"),		// 44
	NULL };

static const TCHAR* g_lpszInputType[] = {
	_T("화재"),			// 0
	_T("화재"),			// 1
	_T("화재"),			// 2
	_T("화재"),			// 3
	_T("화재"),			// 4
	_T("AN연기"),		// 5
	_T("AN정온"),		// 6
	_T("주소형연기"),	// 7
	_T("주소형정온"),	// 8
	_T("주소형차동"),	// 9
	_T("SVP감지기A"),	// 10
	_T("SVP감지기B"),	// 11
	_T("화재"),			// 12
	_T("감시"),			// 13
	_T("화재"),			// 14
	_T("감시"),			// 15
	_T("화재"),			// 16
	_T("화재"),			// 17
	_T("감시"),			// 18
	_T("감시"),			// 19
	_T("감시"),			// 20
	_T("화재"),			// 21
	_T("감시"),			// 22
	_T("화재"),			// 23
	_T("감시"),			// 24
	_T("감시"),			// 25
	_T("감시"),			// 26
	_T("감시"),			// 27
	_T("감시"),			// 28
	_T("감시"),			// 29
	//_T("화재"),			// 30
	//_T("화재"),			// 31
	//_T("화재"),			// 32
	//_T("화재"),			// 33
	_T("감시"),			// 34
	_T("감시"),			// 35
	_T("감시"),			// 36
	_T("화재"),			// 37
	_T("감시"),			// 38
	_T("감시"),			// 39
	_T("감시"),			// 40
	_T("감시"),			// 41
	_T("감시"),			// 42
	_T("감시"),			// 43
	_T("감시"),			// 44
	NULL };

static const TCHAR* g_lpszInputNo[] = {
	_T("1"),	// 0
	_T("1"),	// 1
	_T("1"),	// 2
	_T("1"),	// 3
	_T("1"),	// 4
	_T("6"),	// 5
	_T("7"),	// 6
	_T("9"),	// 7
	_T("8"),	// 8
	_T("8"),	// 9
	_T("2"),	// 10
	_T("3"),	// 11
	_T("5"),	// 12
	_T("10"),	// 13
	_T("5"),	// 14
	_T("10"),	// 15
	_T("1"),	// 16
	_T("1"),	// 17
	_T("10"),	// 18
	_T("10"),	// 19
	_T("10"),	// 20
	_T("5"),	// 21
	_T("10"),	// 22
	_T("5"),	// 23
	_T("10"),	// 24
	_T("10"),	// 25
	_T("10"),	// 26
	_T("10"),	// 27
	_T("10"),	// 28
	_T("10"),	// 29
	//_T("1"),	// 30
	//_T("1"),	// 31
	//_T("5"),	// 32
	//_T("5"),	// 33
	_T("10"),	// 34
	_T("10"),	// 35
	_T("10"),	// 36
	_T("5"),	// 37
	_T("10"),	// 38
	_T("10"),	// 39
	_T("10"),	// 40
	_T("10"),	// 41
	_T("10"),	// 42
	_T("10"),	// 43
	_T("10"),	// 44
	NULL };

static const TCHAR* g_lpszOutputNo[] = {
	_T("2"),	// 0
	_T("2"),	// 1
	_T("0"),	// 2
	_T("0"),	// 3
	_T("0"),	// 4
	_T("0"),	// 5
	_T("0"),	// 6
	_T("0"),	// 7
	_T("0"),	// 8
	_T("0"),	// 9
	_T("3"),	// 10
	_T("4"),	// 11
	_T("0"),	// 12
	_T("0"),	// 13
	_T("0"),	// 14
	_T("0"),	// 15
	_T("0"),	// 16
	_T("0"),	// 17
	_T("7"),	// 18
	_T("7"),	// 19
	_T("8"),	// 20
	_T("0"),	// 21
	_T("8"),	// 22
	_T("0"),	// 23
	_T("6"),	// 24
	_T("5"),	// 25
	_T("5"),	// 26
	_T("6"),	// 27
	_T("0"),	// 28
	_T("0"),	// 29
	//_T("0"),	// 30
	//_T("0"),	// 31
	//_T("0"),	// 32
	//_T("0"),	// 33
	_T("0"),	// 34
	_T("0"),	// 35
	_T("0"),	// 36
	_T("0"),	// 37
	_T("12"),	// 38
	_T("8"),	// 39
	_T("9"),	// 40
	_T("9"),	// 41
	_T("0"),	// 42
	_T("6"),	// 43
	_T("11"),	// 44
	NULL };

enum {
	출력타입_지구경종 = 0, 
	출력타입_1, 
	출력타입_2, 
	출력타입_3, 
	출력타입_4, 
	출력타입_5, 
	출력타입_6, 
	출력타입_7, 
	출력타입_8, 
	출력타입_싸이렌,
	출력타입_밸브,
	출력타입_11,
	출력타입_12,
	출력타입_13,
	출력타입_14,
	출력타입_15,
	출력타입_16,
	출력타입_17,
	출력타입_1차폐쇄,		// 18,
	출력타입_2차폐쇄,		// 19,
	출력타입_전실제연1,		// 20,
	출력타입_21,
	출력타입_전실제연2,		// 22,
	출력타입_23,
	출력타입_자동폐쇄,		// 24
	출력타입_창문폐쇄,		// 25,
	출력타입_배연창,		// 26,
	출력타입_방화문,		// 27,
	출력타입_소화전기동,	// 28,
	출력타입_유도등정지,	// 29,
	/*출력타입_30,
	출력타입_31,
	출력타입_32,
	출력타입_33,*/
	출력타입_34,
	출력타입_35,
	출력타입_36,
	출력타입_37,
	출력타입_거실댐퍼,		// 38,
	출력타입_복합댐퍼,		// 39,
	출력타입_급기팬,		// 40,
	출력타입_배기팬,		// 41,
	출력타입_42,
	출력타입_옥상문,		// 43,
	출력타입_시각경보,		// 44,
};

static const TCHAR* g_lpszOutputCircuit[] = {
	_T("지구 경종"),	// 0
	_T("지구 경종"),	// 1
	_T(""),				// 2
	_T(""),				// 3
	_T(""),				// 4
	_T(""),				// 5
	_T(""),				// 6
	_T(""),				// 7
	_T(""),				// 8
	_T(""),				// 9
	_T("싸이렌"),		// 10
	_T("밸브"),			// 11
	_T(""),				// 12
	_T(""),				// 13
	_T(""),				// 14
	_T(""),				// 15
	_T(""),				// 16
	_T(""),				// 17
	_T("1차폐쇄"),		// 18
	_T("2차폐쇄"),		// 19
	_T("전실제연 "),	// 20
	_T(""),				// 21
	_T("전실제연"),		// 22
	_T(""),				// 23
	_T("자동폐쇄"),		// 24
	_T("창문폐쇄"),		// 25
	_T("배연창"),		// 26
	_T("방화문"),		// 27
	_T("소화전 기동"),	// 28
	_T("유도등 정지"),	// 29
	//_T(""),				// 30
	//_T(""),				// 31
	//_T(""),				// 32
	//_T(""),				// 33
	_T(""),				// 34
	_T(""),				// 35
	_T(""),				// 36
	_T(""),				// 37
	_T("거실댐퍼"),		// 38
	_T("복합댐퍼"),		// 39
	_T("급기팬"),		// 40
	_T("배기팬"),		// 41
	_T(""),				// 42
	_T("옥상문"),		// 43
	_T("시각경보"),		// 43
	NULL };

static const TCHAR* g_lpszOutputType[] = {
	_T("지구음향"),		// 0
	_T("지구음향"),		// 1
	_T(""),				// 2
	_T(""),				// 3
	_T(""),				// 4
	_T(""),				// 5
	_T(""),				// 6
	_T(""),				// 7
	_T(""),				// 8
	_T(""),				// 9
	_T("싸이렌"),		// 10
	_T("프리액션"),		// 11
	_T(""),				// 12
	_T(""),				// 13
	_T(""),				// 14
	_T(""),				// 15
	_T(""),				// 16
	_T(""),				// 17
	_T("방화셔터"),		// 18
	_T("방화셔터"),		// 19
	_T("전실제연"),		// 20
	_T(""),				// 21
	_T("전실제연"),		// 22
	_T(""),				// 23
	_T("출입문제어"),	// 24
	_T("창문제어"),		// 25
	_T("창문제어"),		// 26
	_T("출입문제어"),	// 27
	_T("기타"),			// 28
	_T("기타"),			// 29
	//_T(""),				// 30
	//_T(""),				// 31
	//_T(""),				// 32
	//_T(""),				// 33
	_T(""),				// 34
	_T(""),				// 35
	_T(""),				// 36
	_T(""),				// 37
	_T("상가제연"),		// 38
	_T("전실제연"),		// 39
	_T("제연팬"),		// 40
	_T("제연팬"),		// 41
	_T(""),				// 42
	_T("출입문제어"),	// 43
	_T("시각경보"),	// 44
	NULL
};

// CCircuitBasicInfo::CCircuitBasicInfo()
static const TCHAR* g_lpszCircuitParent[] = {
	_T("발신기"),
	_T("알람밸브"),
	_T("프리액션밸브"),
	_T("시각경보"),
	//_T("가스소화설비"),
	_T("전실제연"),
	_T("상가제연"),
	_T("방화셔터"),
	_T("배연창"),
	_T("방화문"),
	_T("자폐장치"),
	_T("소화전기동확인"),
	_T("옥상개폐확인"),
	_T("저수위감시"),
	_T("제연급기팬"),
	_T("제연배기팬"),
	_T("ADD감지기"),
	NULL
};

enum {
	연동_경종_전층 = 0, 
	연동_경종_계단별직상층,	// 1
	연동_경종_동별직상층,	// 2

	연동_밸브_교차,			// 3
	연동_밸브_아날로그,		// 4
	
	연동_싸이렌_작동연동,	// 5
	연동_싸이렌_동작확인, 
	
	연동_문_전층,			// 7
	연동_문_계단별전층, 
	
	연동_배연창_건물해당층,	// 9
	연동_배연창_계단별해당층, 
	
	연동_급기_건물전층,		// 11
	연동_급기_계단별전층, 
	
	연동_배기_건물해당층,	// 13
	연동_배기_계단별해당층, 
	
	연동_급기팬_계단별,		// 15
	연동_배기팬_계단별, 
	
	연동_셔터_연1_열2,		// 17
	연동_셔터_1차만,		// 18
	연동_셔터_2차만			// 19
};
































































